# WallMeetsRoofTangentially Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinRoofFailures..::..WallMeetsRoofTangentially Property
BuiltInFailures..::..WallJoinRoofFailures Class See Also
---
The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallMeetsRoofTangentially { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallMeetsRoofTangentially As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallMeetsRoofTangentially {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace